export const HEADQUARTERS_OPTIONS = [
  '본사',
  '경기',
  '강원',
  '충북',
  '충남',
  '전북',
  '전남',
  '경북',
  '경남',
  '제주',
  '화안',
  '금강',
  '새만금',
  '영산강',
  '새만금산업단지',
  '토지개발',
  '기타'
] as const;

export const BRANCH_OPTIONS: { [key: string]: string[] } = {
  '본사': ['본사'],
  '경기': [
    '경기본부',
    '여주·이천지사',
    '양평·광주·서울지사',
    '화성·수원지사',
    '연천·포천·가평지사',
    '파주지사',
    '고양지사',
    '강화·옹진지사',
    '김포지사',
    '평택지사',
    '안성지사'
  ],
  '충남': [
    '충남본부',
    '천안지사',
    '공주지사',
    '보령지사',
    '아산지사',
    '서산·태안지사',
    '논산지사',
    '세종·대전·금산지사',
    '부여지사',
    '서천지사',
    '청양지사',
    '홍성지사',
    '예산지사',
    '당진지사'
  ],
  '강원': [
    '강원본부',
    '홍천·춘천지사',
    '원주지사',
    '강릉지사',
    '영북지사',
    '철원지사'
  ],
  '충북': [
    '충북본부',
    '청주지사',
    '보은지사',
    '옥천·영동지사',
    '진천지사',
    '괴산·증평지사',
    '음성지사',
    '충주·제천·단양지사'
  ],
  '전북': [
    '전북본부',
    '남원지사',
    '순창지사',
    '동진지사',
    '부안지사',
    '군산지사',
    '익산지사',
    '전주·완주·임실지사',
    '고창지사',
    '정읍지사',
    '무진장지사'
  ],
  '전남': [
    '전남본부',
    '광주지사',
    '순천·광양·여수지사',
    '나주지사',
    '담양지사',
    '곡성지사',
    '구례지사',
    '고흥지사',
    '보성지사',
    '화순지사',
    '장흥지사',
    '강진지사',
    '해남·완도지사',
    '영암지사'
  ],
  '경북': [
    '경북본부',
    '포항·울릉지사',
    '경주지사',
    '안동지사',
    '구미·김천지사',
    '영주·봉화지사',
    '영천지사',
    '상주지사',
    '문경지사',
    '경산·청도지사',
    '의성·군위지사',
    '청송·영양지사',
    '영덕·울진지사',
    '고령지사',
    '성주지사',
    '칠곡지사',
    '예천지사',
    '달성지사'
  ],
  '경남': [
    '경남본부',
    '김해·양산·부산지사',
    '고성·통영·거제지사',
    '울산지사',
    '진주·산청지사',
    '의령지사',
    '함안지사',
    '창녕지사',
    '밀양지사',
    '창원지사',
    '사천지사',
    '거창·함양지사',
    '합천지사'
  ],
  '제주': [
    '제주본부',
    '서귀포제주지부',
    '농업용수통합광역화추진단'
  ],
  '화안': [
    '사업관리부',
    '시설관리부'
  ],
  '금강': [
    '사업관리부',
    '시설관리부'
  ],
  '새만금': [
    '사업관리부외',
    '사업관리부'
  ],
  '영산강': [
    '사업관리부외',
    '사업관리부'
  ],
  '새만금산업단지': [
    '사업관리부외',
    '사업관리부'
  ],
  '토지개발': [
    '토지관리부',
    '토지개발부'
  ],
  '기타': ['기타']
}; 

// 전역 디버그 로그 플래그 (운영 환경에서는 false 유지)
export const DEBUG_LOGS = false;